function playSound(num){	
    let name = soundList[num];    
    $("#audio").stop();            
    //更換audio檔案
    $("#audio").attr("src" , 'data/' + name + ".mp3");    
}

function randomPlay(){
	let rng = Math.floor(Math.random()* soundList.length);
	$(".grid").get(rng).click();
}

//data list
var soundList = [
	"不如和你聊天",
	"不要抱怨",
	"光是什麼",
	"你有打火機嗎",
	"你夾娃娃很厲害",
	"你沒有把東西還給我",
	"你知道為什麼我感冒了嗎",
	"你是我的寶貝",
	"你是哪裡人啊",
	"你能不能安靜一點",
	"你猜我是什麼星座",
	"你喜歡水嗎",
	"你摸摸我衣服的料",
	"你應該累了吧",
	"我去洗澡了",
	"我去唱歌了",
	"我去買制服",
	"我去開車了",
	"我在找一匹馬",
	"我只會出剪刀",
	"我來娶妳了",
	"我的三觀不正",
	"我的小傻瓜",
	"我的心頭肉",
	"我的缺點",
	"我是九你是三",
	"我剛剛喝了藥",
	"我最近一直在找一家店",
	"我想買一塊地",
	"我跟唐僧的差別",
	"我嘴邊有什麼東西",
	"我覺得越來越不像自己了",
	"我變心了",
	"我們來玩木頭人吧",
	"見不到你的日子",
	"到家了嗎",	
	"昨天晚上夢到你了",	
	"剛剛地震了嗎",
	"哪個英文字母最好看",
	"恭喜你有房了",
	"桃子柿子",
	"除了戀愛跟你沒啥好談的",
	"最近一直覺得很睏",
	"最甜的蜂蜜",
	"給你變個魔術",
	"愛老虎油",
	"過安檢",
	"辣的種類",
	"鴨子的種類",  //48
	//以後應該不會新增總之再看看
	"尛",  //49
	"幹這是一種性騷擾",  //50
	"佳人會歡迎我",	//51
        "病毒",  //52
	"哈哈哈哈",  //53
	"親愛的父老兄弟",  //54
	"hoiyahoiya"  //55
];
